<h3>Визуальный календарь</h3>
<div class="vc-wrapper">
	<div id="visual-calendar" class="visual-calendar"></div>
</div>
<p class="index--comment">
	Оригинальный календарь не содержал предписаний по поводу выходных. Однако государственным служащим в период великой французской революции полагался один выходной (декади, 10 день декады). Предложенная здесь система является идеей авторов сайта (спасибо Леше Филиппову). Количество выходных в году здесь примерно соответстует семидневной неделе с двумя выходными. Выходные отмечены желтым.
</p>